Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G36B.tmx
Source language: en_us
Languages: zh_cn

source: Rob Lowe's memoir "Stories I Only Tell My Friends"
zh_cn: 罗伯·劳自传：那些我只会告诉朋友们的事

source: On the cover of his memoir, Rob Lowe, pictured in a black-and-white head shot worthy of Vogue, shields his eyes with his hands, as though he's staring into a golden Pacific sunset.
zh_cn: 在自传的封面上，罗伯·劳的黑白头像照片使他看起来像风尚人物一样。照片中的他用手遮着眼睛，好像他正在看着太平洋金色的夕阳。

source: His hair is thick and dark, his nose perfectly straight, his jaw chiseled and covered with stubble that's mostly pepper, but with a perfectly judged dash of salt.
zh_cn: 他的头发又密又黑，鼻子很直，下巴布满胡茬，大部分胡茬是黑色的，而中间完美地点缀着灰白色。

source: I looked down at his book's title, "Stories I Only Tell My Friends," and recalled the scandal that occurred after a videotape of Lowe having sex with two girls (one of them underage) surfaced.
zh_cn: 我看到书的名字，《那些我只会告诉朋友们的事》，想起了劳和两个女孩（其中一个未成年）发生关系的录像带出现后的一些流言蜚语。

source: So I thought, right, stories of sun, surf and sex in Malibu.
zh_cn: 于是我想，对，应该是关于在马里布的阳光和性的故事。

source: What else could someone so good-looking and successful write about?
zh_cn: 除此之外，一个如此帅气而又成功的人还会写什么呢？

source: I soon realized I was wrong, wrong, wrong.
zh_cn: 然后我就意识到，我大错特错了。

source: He only briefly discusses the incident (a "mess," a "doozy" of a problem), assuming (no doubt correctly) that nearly everyone knows the details.
zh_cn: 他只是简单的描述了那件事（问题带来的“混乱”和“好处”），假设（而非怀疑）几乎人人都已经知道它细节了。

source: He does recall losing his virginity at 14 as a girlfriend's birthday present to him and acknowledges that by a certain point in his life, he seldom went without sex for more than 30 hours.
zh_cn: 他的确回忆了14岁时，作为女朋友给他的生日礼物，他失去了童贞，并且承认那是他生命中的一个转折点。他很少能忍受超过三十个小时而不做爱这种事。

source: But otherwise most of the stories he only tells his friends in this appealing and attitude-free autobiography are shot through with pain, anxiety and unhappiness.
zh_cn: 但不同的是，在这本吸引人并且态度随意的自传中，大多数他只告诉朋友的事是伴随着痛苦，紧张和悲伤的。

source: Lowe spent his early years far from Malibu, in Dayton, Ohio.
zh_cn: 劳早年离开了俄亥俄州达顿市的马里布。

source: On a humid afternoon when he was 5, his mother told him she was divorcing his father, ending an unhappy marriage in which "claw hammers were thrown" and "lipstick was found in places it shouldn't be."
zh_cn: 在他五岁时一个潮湿的下午，他母亲告诉他，她正在和父亲办离婚，准备结束这段在“锤子乱扔”与“口红在它不应该出现的地方被找到”中不开心的婚姻。

source: Long after that day, Lowe writes, "anything painful surrounding my parents' breakup I sealed off and buried, left unexplored and undisturbed, like nuclear waste."
zh_cn: 那天之后很久，劳写道“任何关于我父母分手的痛苦我都封了起来并且毁掉了，留下的只有未知和不被困扰，就像核污染一样。”

source: Trauma and abandonment can create a young actor's perfect storm, and Lowe stepped right into his, whirling off to an early acting audition that played like a scene from "Gypsy."
zh_cn: 创伤和放纵可以激发年轻演员的表演热情。劳迈入了他自己表演中，以其表现像“吉普赛”中的场景而迅速进入早期试演。

source: In Columbus, he met producer John Kenley.
zh_cn: 在哥伦布，他遇见了制片人约翰·垦利。

source: "He appears to be wearing whiteface and red lipstick like Cesar Romero as the Joker from 'Batman,'?" Lowe writes. "He looks anywhere from 80 to 180 years old."
zh_cn: “他似乎化妆成白脸，并用了大红的唇膏，就像是凯撒·罗摩洛在《蝙蝠侠》里扮演的小丑，”劳写道，“他看起来任何地方都有80到180岁那么老了。”

source: On the way home, a woman told Lowe that during winter months in Florida, John Kenley became Joan Kenley.
zh_cn: 在回家的路上，一个女人告诉劳，经过在佛罗里达的冬季，约翰·垦利变成了乔·垦利。

source: Lowe eventually did get to Malibu, when his mother, after divorce No. 2, packed him and his brothers into a car and struck out for California's cleaner air.
zh_cn: 劳最终的确回到了马里布。当他的母亲第二次离婚后，她载着他和他的兄弟们奔向了加州更清新的空气。

source: Lowe's life there as a young teenager was often bizarre.
zh_cn: 劳在那儿像年轻人一样的生活经常是古怪的。

source: One classmate, thinking he was doing cocaine, snorted rat poison and died instantly.
zh_cn: 一个同学，认为自己在服用可卡因，吸食了鼠药后立即死亡了。

source: Another friend lost control of a 10-speed, impaled his head on a eucalyptus tree and bled to death.
zh_cn: 另一个朋友在一辆十速车上失控了，他的脑袋被桉树刺穿了，失血过多而死。

source: "The ranks of the Lost Boys of Malibu," Lowe writes, "grew at a steady rate."
zh_cn: “一群马里布的失足青年，”劳写道，“以稳定的趋势增长着。”

source: When Lowe sought escape from these nightmares by acting in plays, classmates shunned him as "an acting fag."
zh_cn: 当劳通过表演找到了这些梦魇的出口时，同学们躲避他像在躲避一个“跑龙套的”。

source: He had the good luck to fall in with neighbors Sean and Chris Penn, Emilio Estevez and brother Charlie Sheen as they (mostly) steadied their lives by ardently learning the actors' craft and trade.
zh_cn: 他很幸运地偶遇了邻居辛恩，克里斯·潘，埃米利奥·埃斯特乌兹，以及查理·辛兄弟。他们（大部分）通过积极热情地学习演技来维持生活的稳定。

source: After appearing in some ABC after-school specials, Lowe copped his first movie role in Francis Ford Coppola's "The Outsiders.
zh_cn: 在一些美国广播公司的课外专题节目中演出后，劳在弗朗西斯·福特·科波拉的《局外人》中得到了他的第一个电影角色。

source: He recalls being on location in Tulsa and putting in 14-hour days that became "a euphoric and toxic mix of excitement, boredom, anonymity, recognizability, and loneliness."
zh_cn: 他回忆起在图尔沙拍外景和度过14小时的日子，那已经成了“混杂着兴奋、无聊、无名、认可以及孤单，令人兴奋而有毒的日子。”

source: Coppola's weekly food-and-wine festivals and the "frenzied, available" local girls soothed Lowe's nerves.
zh_cn: 科波拉的每周食物酒会以及当地“狂热而空闲”的女孩子抚慰着劳的神经。

source: Officially a movie star after "The Outsiders," Lowe worked a lot in films and played a lot more in bars, clubs and bedrooms.
zh_cn: 在《局外人》以后，劳正式成为了电影明星。他更努力在电影界工作，并且更经常地流连于酒吧，夜店和卧室。

source: Fans broke into his house to steal his underwear.
zh_cn: 粉丝闯入他的房间偷走了他的内裤。

source: He even ended up in bed with Michael J. Fox at 4:30 one morning, but it wasn't what you might think.
zh_cn: 甚至在一天早上的4:30，他在床上与迈克尔·J·福克斯结束了关系，但是它可能并不是你想的那样。

source: By age 25, he felt he was "way past warranty."
zh_cn: 在25岁的时候，他觉得他是“过了保修期”。

source: Finally, one night in 1990, when he was "so hammered [he could] barely stand," he decided to check into an Arizona rehab facility.
zh_cn: 最终，在1990年的一个晚上，当他“太受打击【他可以】而不能承受时，”他决定进入亚利桑那的戒毒所。

source: The years since recovery have brought Lowe marriage, two sons and a four-season run on the hit TV series "The West Wing," followed by three more TV series and a film - "I Melt With You" - to be released this year.
zh_cn: 恢复的几年为劳带来了婚姻，两个儿子以及在热播电视剧《白宫风云》中一年的出演。紧接着就是三部电视剧和一部电影——《与你共融》——将在今年上映。

source: Looking back at his life, he sounds wise, mature and content. "Nothing in life is unfair," he writes.
zh_cn: 回首他的人生，他是明智、成熟而满足的。“生命中没有什么是不公平的”，他写道。

source: "It is just life.
zh_cn: “这就是人生。

source: To the extent that I had any inner turmoil, I had only myself to blame."
zh_cn: 在某种程度上我有过内心的挣扎，我只能责备自己。”

source: Lowe's writing lacks a distinctive voice, but his attitude is so straightforward and vulnerable that many readers, appreciating his cautionary tale, might want to shake his hand.
zh_cn: 劳的写作手法缺乏特色，但是他的态度是如此的直白而毫无防备，以至于许多读者了解他具有警戒意味的故事后，想要来和他握握手。

source: That possibility may answer a question I asked when his book crossed my desk: Why did Lowe, just 47, pen a memoir?
zh_cn: 这种可能性也许就回答了当他的书放在我桌子上时我提出的一个问题：为什么劳在仅仅47岁的时候就要写一部自传呢？

source: Considering his frequent, enthusiastic involvement with liberal political causes, which he mentions throughout the book, I wondered if he was planting clues.
zh_cn: 考虑到他频繁地、狂热地涉及无偏见的政治事件中，这本书中他字里行间提到的事情，我猜想他是否在留下些线索。

source: As the former star of a TV series set in a fictional Washington, is he thinking of working in a real Washington?
zh_cn: 正如电视剧中在虚拟的美国政府中表现的那样， 他是否考虑为真正的美国政府工作呢？

source: Idle speculation, I admit.
zh_cn: 我承认，这是无聊的推测。

source: Yet actors less good-looking - and less self-reflective - have made that transition.
zh_cn: 然而演员们日益减少的美貌和越来越少的自我反省已经造成了那种转变。
